# 2. Найти максимальное из пяти чисел

# a = int(input('Введите первое число'))

# b = int(input('Введите второе число'))

# c = int(input('Введите третье число'))

# d = int(input('Введите четвертое число'))      # Простой и рабочий вариант решения 

# e = int(input('Введите пятое число')) 

# max = a

# if b > max:
#     max = b
# if c > max:
#     max = c
# if d > max:
#     max = d
# if e > max:
#     max = e
# print(max)

# list = [10, 11, 8, 18, 2]

# max_elem = max(list)               # Решение задачи списком практически в одну строку с помощью функции max(list)

# print('Максимальное значение элемента равно', max_elem)