# 25. Написать программу преобразования десятичного числа в двоичное.

# a = int(input('Введите любое число: '))
# result = []
# while a:
#     result.append(a % 2)
#     a //= 2
# result.reverse()
# print(result)
# --------------------------------------------------------------------------------------------------
# number = int(input('Введите любое число: '))       # с помощью встроенной функции перевода python
# print(bin(number))
# --------------------------------------------------------------------------------------------------
