# 3. Вывести на экран числа от -N до N

print('Введите число')

N = int(input())

for i in range(-N, N + 1):
    print(i)